acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="51b9a2d4-bd53-4f40-824e-e3b4e323279e">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0a7fcfed-5717-4d55-8975-5701eae7eb00">
    <name>ОсновноеКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Аид_СтатусКонтрагента</name>
    <type>
      <types>CatalogRef.Аид_СтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аид_ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аид_ДругойЧасовойПояс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="1f7a6d90-e1f2-4582-90f0-cfdef6d12cac">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="15cff28b-5c4c-4e8a-a561-b2d68021071b">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dc2d99d0-72f0-435d-9716-43c1b3c0bcf6">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Аид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Аид_СоздатьЭлементыФормыСервер();
	
	Аид_СтатусКонтрагента = Объект.Аид_СтатусКонтрагента;
	Аид_ЧасовойПояс = Объект.Аид_ЧасовойПояс;
	Аид_ДругойЧасовойПояс = Объект.Аид_ДругойЧасовойПояс;
	
	Элементы.Аид_ЧасовойПояс.СписокВыбора.Очистить();
	СписокЧП = Аид_СписокВыбораЧасовыхПоясов();
	Для каждого ЭлемЧП из СписокЧП Цикл
		Элементы.Аид_ЧасовойПояс.СписокВыбора.Добавить(ЭлемЧП.Значение, ЭлемЧП.Представление);
	КонецЦикла;
	Аид_УстановитьВидимость();

КонецПроцедуры


Функция Аид_СписокВыбораЧасовыхПоясов()
	
	Возврат Аид_ОбщегоНазначенияПереопределяемый.ПолучитьСписокЧасовыхПоясов();
	
КонецФункции

&НаСервере
Процедура Аид_ПолучитьЧасовойПоясПослеНаСервере()
	
	ЧасовойПояс = Аид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясКонтрагента(Объект.Ссылка);
	
	Если ЧасовойПояс = неопределено Тогда
		//Пробуем еще определить по контрагенту.
		ЧасовойПояс = Аид_ОбщегоНазначенияПереопределяемый.ПолучитьЧасовойПоясКонтрагента(Объект.Ссылка);
	КонецЕсли;
	
	Если ЧасовойПояс = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить часовой пояс контрагента. Проверьте заполнение адреса!");
	Иначе
		Аид_ЧасовойПояс = ЧасовойПояс;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Аид_ПолучитьЧасовойПоясПосле(Команда)
	Аид_ПолучитьЧасовойПоясПослеНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_УстановитьВидимость()
	Элементы.Аид_ЧасовойПояс.Видимость = Аид_ДругойЧасовойПояс;
	Элементы.ПолучитьЧасовойПояс.Видимость = Аид_ДругойЧасовойПояс;
КонецПроцедуры

&НаКлиенте
Процедура Аид_ДругойЧасовойПоясПриИзмененииПосле(Элемент)
	Аид_УстановитьВидимость();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Аид_ЧасовойПоясПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_СоздатьЭлементыФормыСервер()
	
	Если Элементы.Найти("Аид_СтатусКонтрагента") = Неопределено тогда
		НовыйЭлементСтатусКонтрагента = Элементы.Вставить("Аид_СтатусКонтрагента", Тип("ПолеФормы"), Элементы.ГруппаАдреса, Неопределено);
		НовыйЭлементСтатусКонтрагента.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементСтатусКонтрагента.ПутьКДанным = "Объект.Аид_СтатусКонтрагента";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Аид_СтатусКонтрагентаПриИзмененииПосле(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура Аид_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Аид_СтатусКонтрагента = Аид_СтатусКонтрагента;
	ТекущийОбъект.Аид_ЧасовойПояс = Аид_ЧасовойПояс;
	ТекущийОбъект.Аид_ДругойЧасовойПояс = Аид_ДругойЧасовойПояс;

КонецПроцедуры
